--[[

        Language.lua
        exported by excel2lua.py
        from file:Language.xlsx

--]]

local Language = {
    [1] = {
        id = 1,
        content = '确认',
    },
    [2] = {
        id = 2,
        content = '取消',
    },
    [3] = {
        id = 3,
        content = '返回',
    },
    [4] = {
        id = 4,
        content = '提示',
    },
    [5] = {
        id = 5,
        content = '出售',
    },
    [6] = {
        id = 6,
        content = '购买',
    },
    [7] = {
        id = 7,
        content = '第一人称',
    },
    [8] = {
        id = 8,
        content = '第三人称',
    },
    [9] = {
        id = 9,
        content = '所有人',
    },
    [10] = {
        id = 10,
        content = '[7d4830]已满级[-][ff0000]',
    },
    [11] = {
        id = 11,
        content = '[7d4830]需要[-]{0}    [7d4830]现有{1}[-]',
    },
    [12] = {
        id = 12,
        content = '{x}分钟前',
    },
    [13] = {
        id = 13,
        content = '{0}级',
    },
    [14] = {
        id = 14,
        content = '物攻',
    },
    [15] = {
        id = 15,
        content = '物防',
    },
    [16] = {
        id = 16,
        content = '法攻',
    },
    [17] = {
        id = 17,
        content = '法防',
    },
    [18] = {
        id = 18,
        content = '暴击',
    },
    [19] = {
        id = 19,
        content = '金币不足',
    },
    [20] = {
        id = 20,
        content = '登录失败',
    },
    [21] = {
        id = 21,
        content = '岛内公告,',
    },
    [22] = {
        id = 22,
        content = '快来说点儿什么吧...',
    },
    [23] = {
        id = 23,
        content = '显示海岛系统公告，内容可显示文字和图标',
    },
    [24] = {
        id = 24,
        content = '已经领取',
    },
    [25] = {
        id = 25,
        content = '条件未达成，奖励不可领',
    },
    [26] = {
        id = 26,
        content = '当前任务不存在',
    },
    [1001] = {
        id = 1001,
        content = '勇敢的[ROLE]，我们将要遭受到炎魔大军的全面进攻，这个城市即将遭到破坏，无数人民将生灵涂炭！为了圣光女神，请求您去月光之城请求援军，共同抵抗军团入侵！',
    },
    [1002] = {
        id = 1002,
        content = '给我足够的好处，我就去！不然，我就去投奔炎魔之王了！',
    },
    [1003] = {
        id = 1003,
        content = '你没有信仰！圣光将诅咒你！哼!不过，你要是去的话我们将给你很多很多的金币和一件至高无上的法宝',
    },
    [1004] = {
        id = 1004,
        content = '嗯，说话算话，否则你就是个超级大骗子！',
    },
    [1005] = {
        id = 1005,
        content = '亲爱的[ROLE]，你有什么事吗！',
    },
    [1006] = {
        id = 1006,
        content = '听说你们兵强马壮，我们城主想和你们联合起来共同抵抗炎魔大军的入侵！',
    },
    [1007] = {
        id = 1007,
        content = '额，原来是这样！卫兵们，把他抓起来，献给炎魔大大做祭品！',
    },
    [1008] = {
        id = 1008,
        content = '额，其实我是炎魔的使者，来看看你是不是衷心归顺于我们的！不要逃耍花样!',
    },
}
return Language